Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4221.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="18xxxx" edc:clonedfrom="PIC18F4221" edc:desc="" edc:dosid="00635" edc:dsid="30009689" edc:informedby="DOS PS DS" edc:masksetid="" edc:name="PIC18LF4221" edc:procid="0xA224" edc:psid="30009622" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:isextended="true">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power edc:hashighvoltagemclr2="true">
    <edc:VPP edc:defaultvoltage="13.000" edc:maxvoltage="13.250" edc:minvoltage="9.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true" edc:lvpthresh="3.000" edc:memtech="ee" edc:panelsize="0x0" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="lverase" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="10000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="5000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="eedata" edc:time="4000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="userid" edc:time="5000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="64" edc:progop="rowerase"/>
    <edc:ProgrammingRowSize edc:nzsize="8" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="2" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="2" edc:progop="eedata"/>
    <edc:ProgrammingRowSize edc:nzsize="8" edc:progop="userid"/>
    <edc:Wait edc:lverase="1000" edc:lvpgm="1000" edc:erase="10000" edc:pgm="1000" edc:cfg="5000" edc:eedata="4000" edc:userid="5000"/>
    <edc:Latches edc:rowerase="64" edc:pgm="8" edc:cfg="2" edc:eedata="2" edc:userid="8"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="16" edc:hwstackdepth="31">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0xf00000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="egg"/>
  <edc:WatchdogTimer edc:min="4"/>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="0x3" edc:idbyte="p"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x1000" edc:regionid="page"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x2000c0" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200008" edc:regionid="idlocs"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x30000e" edc:regionid="config">
      <edc:AdjustPoint edc:offset="1" edc:_addr="0x300000"/>
      <edc:DCRDef edc:access="nn--nnnn" edc:cname="CONFIG1H" edc:desc="" edc:factorydefault="0x07" edc:impl="0xcf" edc:name="CONFIG1H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xcf" edc:default="0x07" edc:_addr="0x300001">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="OSC" edc:desc="Oscillator" edc:mask="0xf" edc:name="OSC" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:desc="11XX External RC oscillator, CLKO function on RA6" edc:islanghidden="true" edc:when="(field &amp; 0xc) == 0xc"/>
              <edc:DCRFieldSemantic edc:desc="101X External RC oscillator, CLKO function on RA6" edc:islanghidden="true" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="INTIO1" edc:desc="Internal oscillator block, CLKO function on RA6, port function on RA7" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="INTIO2" edc:desc="Internal oscillator block, port function on RA6 and RA7" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="RCIO" edc:desc="External RC oscillator, port function on RA6" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="HSPLL" edc:desc="HS oscillator, PLL enabled (Clock Frequency = 4 x FOSC1)" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="ECIO" edc:desc="EC oscillator, port function on RA6" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC oscillator, CLKO function on RA6" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="RC" edc:desc="External RC oscillator, CLKO function on RA6" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Oscillator" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT Oscillator" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP Oscillator" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="FCMEN" edc:desc="Fail-Safe Clock Monitor Enable bit" edc:mask="0x1" edc:name="FCMEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Fail-Safe Clock Monitor enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Fail-Safe Clock Monitor disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal/External Oscillator Switchover bit" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Oscillator Switchover mode enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator Switchover mode disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="---nnnnn" edc:cname="CONFIG2L" edc:desc="" edc:factorydefault="0x1f" edc:impl="0x1f" edc:name="CONFIG2L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1f" edc:default="0x1f" edc:_addr="0x300002">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="PWRT" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOR" edc:desc="Brown-out Reset Enable bits" edc:mask="0x3" edc:name="BOR" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Brown-out Reset enabled in hardware only (SBOREN is disabled)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NOSLP" edc:desc="Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SOFT" edc:desc="Brown-out Reset enabled and controlled by software (SBOREN is enabled)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Brown-out Reset disabled in hardware and software" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown-out Reset Voltage bits" edc:mask="0x3" edc:name="BORV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="3" edc:desc="Minimum Setting" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="0" edc:desc="Maximum Setting" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
